## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 2 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                             NAME                                             |
|----------|----------------------------------------------------------------------------------------------|
| update   | `aws_wafv2_regex_pattern_set.forms_base_url`                                                 |
|          | `aws_wafv2_regex_pattern_set.valid_app_uri_paths`                                            |
| recreate | `aws_route53_record.form_viewer[0]`                                                          |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-formulaires.alpha.canada.ca&quot;]` |
|          | `aws_shield_protection.route53_hosted_zone[0]`                                               |
| add      | `aws_route53_record.form_viewer[1]`                                                          |
|          | `aws_shield_protection.route53_hosted_zone[1]`                                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.form_viewer[0] must be replaced
  # (moved from aws_route53_record.form_viewer)
-/+ resource "aws_route53_record" "form_viewer" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "forms-formulaires.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z1031499PBK3926Y7HKK_forms-formulaires.alpha.canada.ca_A" -> (known after apply)
        name            = "forms-formulaires.alpha.canada.ca"
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z1031499PBK3926Y7HKK" -> "mocked_zone_id_forms-formulaires.alpha.canada.ca" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[1] will be created
  + resource "aws_route53_record" "form_viewer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "forms-formulaires.canada.ca"
      + type            = "A"
      + zone_id         = "mocked_zone_id_forms-formulaires.canada.ca"

      + alias {
          + evaluate_target_health = true
          + name                   = "form-viewer-1039776084.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-formulaires.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "form_viewer_certificate_validation" {
      ~ fqdn            = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z1031499PBK3926Y7HKK__d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca._CNAME" -> (known after apply)
        name            = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca"
      ~ zone_id         = "Z1031499PBK3926Y7HKK" -> "mocked_zone_id_forms-formulaires.alpha.canada.ca" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_shield_protection.route53_hosted_zone[0] must be replaced
  # (moved from aws_shield_protection.route53_hosted_zone)
-/+ resource "aws_shield_protection" "route53_hosted_zone" {
      ~ arn          = "arn:aws:shield::957818836222:protection/abb8c7ef-5e58-4b87-afe6-2eeb93734f51" -> (known after apply)
      ~ id           = "abb8c7ef-5e58-4b87-afe6-2eeb93734f51" -> (known after apply)
        name         = "Route53HostedZone"
      ~ resource_arn = "arn:aws:route53:::hostedzone/Z1031499PBK3926Y7HKK" -> "arn:aws:route53:::hostedzone/mocked_zone_id_forms-formulaires.alpha.canada.ca" # forces replacement
        tags         = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_shield_protection.route53_hosted_zone[1] will be created
  + resource "aws_shield_protection" "route53_hosted_zone" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "Route53HostedZone"
      + resource_arn = "arn:aws:route53:::hostedzone/mocked_zone_id_forms-formulaires.canada.ca"
      + tags         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "e1ceb832-c7e4-4b53-a818-44a55e27b3e4"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "forms-formulaires.alpha.canada.ca$" -> null
        }
      + regular_expression {
          + regex_string = "^forms-formulaires.alpha.canada.ca$"
        }
      + regular_expression {
          + regex_string = "^forms-formulaires.canada.ca$"
        }
    }

  # aws_wafv2_regex_pattern_set.valid_app_uri_paths will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "valid_app_uri_paths" {
        id          = "f3927a12-2101-47c6-9a47-7353ac95ba92"
        name        = "valid_app_uri_paths"
        tags        = {}
        # (5 unchanged attributes hidden)

      + regular_expression {
          + regex_string = "^\\/?(BingSiteAuth\\.xml|googlef34bd8c094c26cb0\\.html)$"
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 3 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
